<template>
    <!-- 大的盒子 -->
    <div class="box">
        <!-- 头部的广告 -->
        <div class="gg"><img src="../Login/images/2.jpg" alt=""></div>
        <!-- 第二行的盒子 -->
        <div class="box1">
            <!-- 首页的图标 -->
            <div class="svg-1">
                <svg t="1669397326320" class="icon-1" viewBox="0 0 1024 1024" version="1.1"
                    xmlns="http://www.w3.org/2000/svg" p-id="4140" width="20" height="20">
                    <path
                        d="M1014.613212 543.119765c-3.970428 3.806699-9.076726 5.699816-14.172791 5.699816-5.372358 0-10.744715-2.108011-14.766308-6.293333l-64.539922-67.24145 0 523.543917c0 11.307533-9.15859 20.466124-20.466124 20.466124l-265.261433 0c-11.307533 0-20.466124-9.15859-20.466124-20.466124 0-11.2973 9.15859-20.466124 20.466124-20.466124l244.795309 0 0-545.729196-367.233895-382.614188-367.223662 382.593721 0 545.749662 224.329185 0L370.07357 672.353105c0-11.307533 9.168824-20.466124 20.466124-20.466124l244.86694 0c11.2973 0 20.466124 9.15859 20.466124 20.466124 0 11.2973-9.168824 20.466124-20.466124 20.466124l-224.400816 0 0 306.009486c0 11.307533-9.15859 20.466124-20.466124 20.466124l-265.261433 0c-11.2973 0-20.466124-9.15859-20.466124-20.466124L104.812137 475.264331l-64.550155 67.251683c-7.828292 8.15575-20.783349 8.42181-28.939099 0.593518s-8.42181-20.783349-0.593518-28.939099L498.201739 6.293333c3.857864-4.021593 9.18929-6.293333 14.766308-6.293333 5.566786 0 10.898211 2.27174 14.756075 6.293333l487.482607 507.887332C1023.035022 522.336416 1022.768963 535.291472 1014.613212 543.119765z"
                        p-id="4141"></path>
                </svg>
            </div>
            <!-- 文字的盒子-->
            <div class="text">
                <text>值得买</text>
            </div>
            <!-- 购物车和搜索的图标盒子 -->
            <div class="svg-2">
                <!-- 购物车的图标 -->
                <svg t="1669397122661" class="icon-2" viewBox="0 0 1024 1024" version="1.1"
                    xmlns="http://www.w3.org/2000/svg" p-id="3226" width="20" height="20">
                    <path
                        d="M848 712H318.4c-25.6 0-46.4-19.2-48-41.6L240 201.6c-1.6-25.6-16-46.4-38.4-57.6l-48-20.8c-12.8-4.8-25.6 0-32 12.8s0 25.6 12.8 32l46.4 20.8c6.4 3.2 11.2 9.6 11.2 17.6l28.8 468.8c3.2 48 46.4 86.4 96 86.4H848c12.8 0 24-11.2 24-24s-11.2-25.6-24-25.6z"
                        p-id="3227"></path>
                    <path
                        d="M884.8 265.6c-14.4-16-35.2-25.6-57.6-25.6H337.6c-12.8 0-24 11.2-24 24s11.2 24 24 24h489.6c8 0 16 3.2 20.8 9.6 4.8 6.4 8 14.4 8 22.4l-38.4 211.2v1.6c-1.6 14.4-12.8 24-27.2 25.6l-420.8 32c-12.8 1.6-22.4 12.8-22.4 25.6 1.6 12.8 11.2 22.4 24 22.4h1.6l419.2-32c36.8-3.2 67.2-30.4 70.4-67.2l38.4-212.8v-1.6c4.8-20.8-1.6-43.2-16-59.2z"
                        p-id="3228"></path>
                    <path d="M305.6 856m-56 0a56 56 0 1 0 112 0 56 56 0 1 0-112 0Z" p-id="3229"></path>
                    <path d="M753.6 856m-56 0a56 56 0 1 0 112 0 56 56 0 1 0-112 0Z" p-id="3230"></path>
                </svg>
                <!-- 搜索的图标 -->
                <svg t="1669397372819" class="icon-3" viewBox="0 0 1024 1024" version="1.1"
                    xmlns="http://www.w3.org/2000/svg" p-id="5040" width="20" height="20">
                    <path
                        d="M955.069071 864.311021 740.015134 649.258107c-3.752464-3.751441-8.841366-5.860475-14.149255-5.860475-5.306866 0-10.395768 2.108011-14.149255 5.860475l-16.692171 16.692171-38.34226-38.34226c53.03796-59.810201 85.298711-138.442072 85.298711-224.478588 0-186.774871-151.952784-338.727655-338.727655-338.727655S64.527642 216.35456 64.527642 403.12943c0 186.775894 151.952784 338.728678 338.727655 338.728678 86.36909 0 165.276231-32.510438 225.170343-85.913718l38.303374 38.303374-17.34504 17.34504c-7.812943 7.813966-7.812943 20.48352 0 28.297486l215.051891 215.052914c3.753487 3.751441 8.841366 5.860475 14.149255 5.860475 5.306866 0 10.395768-2.108011 14.149255-5.860475l62.334697-62.334697C962.883037 884.794541 962.883037 872.124987 955.069071 864.311021zM104.546078 403.12943c0-164.709319 133.9999-298.709219 298.709219-298.709219s298.709219 133.9999 298.709219 298.709219S567.964616 701.839673 403.255297 701.839673 104.546078 567.838749 104.546078 403.12943zM878.585119 912.496463 691.829691 725.741036l34.036187-34.036187 186.755428 186.755428L878.585119 912.496463z"
                        p-id="5041"></path>
                </svg>
            </div>
        </div>
        <!-- 中间轮播图的盒子 -->
        <div class="box2">
            <!-- 文字 -->
            <div class="el-text">
                <text class="bigtext">值得买</text>
                <text>严选好物 用心生活</text>
            </div>
            <!-- 轮播图 -->
            <el-carousel indicator-position="outside" trigger="hover">
                <el-carousel-item v-for="item in 6" :key="item">
                    <img src="../Login/images/2.jpg" alt="" class="el-img">
                </el-carousel-item>
            </el-carousel>
        </div>
        <!-- 瀑布流的盒子 -->
        <div class="box3">
            <div class="text-3">足够用心才足够特别-</div>
            <div id="macy-container">
                <div>
                    <img src="../Login/images/2.jpg" />
                </div>
            </div>
        </div>
    </div>
</template>
<script src="macy.js">
</script>
<script>
    var masonry = new Macy({
    container: '#macy-container', // 图像列表容器id
    trueOrder: false,
    waitForImages: false,
    useOwnImageLoader: false,
    debug: true,
 
    //设计间距
    margin: {
      x: 10,
      y: 10
    },
 
    //设置列数
    columns: 6,
 
    //定义不同分辨率（1200，940，520，400这些是分辨率）
    breakAt: {
     1200: {
      columns: 5,
      margin: {
        x: 23,
        y: 4
      }
     },
     940: {
      margin: {
        y: 23
      }
     },
     520: {
      columns: 3,
      margin: 3,
     },
     400: {
      columns: 2
     }
    }
   });
</script>
<!-- <script setup lang="ts">

</script> -->


<style scoped>
.gg {
    width: 100%;
    height: 50px;
}

.svg-1 {
    line-height: 50px;
}

.svg-2 {
    margin: auto;
    line-height: 50px;
    display: flex;
}

.gg img {
    width: 100%;
    height: 50px;
}

.box1 {
    height: 40px;
    width: 100%;
    background: pink;
    display: flex;
    line-height: 40px;
}

.icon-1 {
    padding: 0px 140px 0px 10px;

}

.text {
    padding: 0px 50px 0px 0px;
    font-size: 20px;
}

.icon-3 {
    padding: 0px 0px 0px 20px;
}

/* 值得买第二个盒子 */
.box2 {
    /* margin: 10px 0; */
    width: 100%;
    height: 380px;
    background: rgb(242, 117, 138);
}

.el-carousel__item h3 {
    display: flex;
    color: #475669;
    opacity: 0.75;
    line-height: 300px;
    margin: 0;
}

.el-carousel__item:nth-child(2n) {
    background-color: #99a9bf;
}

.el-carousel__item:nth-child(2n + 1) {
    background-color: #d3dce6;
}

.el-img {
    height: 100%;
    width: 100%;
}

.el-text {
    height: 50px;
    line-height: 50px;
    display: flex;
}

.bigtext {
    font-size: 25px;
    margin: 0 10px;
}
</style>